<html>
<head>
<style type="text/css">
  body {
	font-family:Verdana, Geneva, sans-serif;
    color: #3B3B3B;
	background-color: #F5F9FF;
	}
  </style>
</head>
<body>
<h1>Manual de usuario</h1>

<h2>1. Sesiones de usuario</h2>
<h3>1.1 Iniciar sesi&oacute;n</h3>
Para iniciar sesi&oacute;n es necesario contar con una cuenta de usuario activa. Al iniciar sesi&oacute;n el programa reconoce autom&aacute;ticamente el nivel de privilegios del usuario y s&oacute;lo le permitir&aacute; ejecutar aquellas funciones para las que est&aacute; autorizado. A continuaci&oacute;n se muestra la pantalla para iniciar sesi&oacute;n:
<br><img src="screens/login.png" /><br>
Mientras utiliza el sistema, puede que ocurran errores de permisos. Esto significa que usted est&aacute; intentando realizar una operaci&oacute;n para la que no tiene permisos suficientes. Cuando ocurra dicho error, se mostrar&aacute; la siguiente pantalla:
<br><img src="screens/permerror.png" /><br>
<h3>1.2 Cerrar sesi&oacute;n</h3>
En caso de que
un diferente empleado quiera tener acceso a las funcionalidades del sistema, el usuario actual deber&aacute; cerrar su sesi&oacute;n y el nuevo empleado iniciar la suya. Cerrar la sesi&oacute;n significa cerrar la aplicaci&oacute;n hasta que otro empleado con un usuario activo inicie sesi&oacute;n. Para cerrar una sesi&oacute;n vaya al men&uacute; Archivo / Cerrar sesi&oacute;n.<br> 

<h2>2. Administraci&oacute;n de clientes</h2>
<h3>2.1 Dar de alta</h3>
Para dar de alta un cliente vaya al men&uacute; Archivo / Nuevo miembro... Deber&aacute; ver una pantalla como la que se muestra a continuaci&oacute;n:
<br><img src="screens/newmember.png" width="944" height="524" /><br>
La forma se validar&aacute; al momento de dar clic en el bot&oacute;n de Agregar. En caso de que exista alg&uacute;n error al llenar la forma, se le indicar&aacute; para su correcci&oacute;n. Cuando usted selecciona M&eacute;xico como pa&iacute;s, la forma autom&aacute;ticamente desplegar&aacute; la lista de estados de la Rep&uacute;blica para que usted elija el apropiado. La aplicaci&oacute;n mostrar&aacute; pantallas de &eacute;xito o de error seg&uacute;n sea el caso. 
<h3>2.2 Buscar</h3>
La &uacute;nica forma de buscar a un cliente es por su n&uacute;mero de identificaci&oacute;n. La manera est&aacute;ndar de lectura de n&uacute;meros de identificaci&oacute;n es a trav&eacute;s del lector de barras leyendo la credencial de cada miembro. La aplicaci&oacute;n buscar&aacute; al miembro en la base de datos de la sucursal local y en la informaci&oacute;n que se tenga sincronizada del resto de las sucursales. En caso de que el miembro sea local, se tendr&aacute; acceso a toda su informaci&oacute;n y se podr&aacute; modificar como sea necesario. Sin embargo, si se trata de un cliente externo, &uacute;nicamente se podr&aacute; ver a qu&eacute; sucursal pertenece y su fotograf&iacute;a. A continuaci&oacute;n se muestra la pantalla de b&uacute;squeda de miembros, en el cuadro de texto deber&aacute; teclearse o leerse con el scanner de c&oacute;digos de barras el n&uacute;mero de identificaci&oacute;n del cliente.
<br><img src="screens/memberid.png" width="419" height="295" /><br>
En caso de que el cliente no se haya encontrado localmente o en otra de las sucursales, se mostrar&aacute; la siguiente pantalla:
<br><img src="screens/wrongmemberid.png" width="419" height="266" /><br>
Si el miembro existe en la base de datos se le mostrar&aacute; una lista de acciones posibles para ese miembro como la que se muestra a continuaci&oacute;n:
<br><img src="screens/memberoptions.png" width="532" height="258" /><br>
<h3>2.3 Actualizar informaci&oacute;n personal</h3>
Para actualizar informaci&oacute;n personal de un cliente ser&aacute; necesario primeramente buscarlo.Para buscarlo lea el inciso 2.2. En la ventana de opciones seleccione &quot;Actualizar informaci&oacute;n personal&quot; y d&eacute; clic en OK. Ver&aacute; una pantalla como la siguiente:
<br><img src="screens/updatemember.png" width="936" height="524" /><br>
Estando en esta pantalla, haga los cambios necesarios y d&eacute; clic en &quot;Guardar cambios&quot; para actualizar la informaci&oacute;n en la base de datos. Si la operaci&oacute;n fue exitosa, ver&aacute; una pantalla como la siguiente:
<br><img src="screens/updatemembersuccess.png" width="448" height="258" /><br>
<h3>2.4 Administrar fichas</h3>
Para agregar o restar fichas de un cliente ser&aacute; necesario primeramente buscarlo.Para buscarlo lea el inciso 2.2. En la ventana de opciones seleccione &quot;Administrar fichas&quot; y d&eacute; clic en OK. Ver&aacute; una pantalla como la siguiente:
<br><img src="screens/adminchips.png" width="330" height="181" /><br>
Escriba la cantidad en el cuadro de texto y d&eacute; clic sobre el bot&oacute;n deseado ya sea para agregar o restar la cantidad escrita. Dada la importancia de la operaci&oacute;n se le preguntar&aacute; confirmaci&oacute;n:
<br><img src="screens/adminchipsconf.png" width="536" height="258" /><br>
Si la operaci&oacute;n fue exitosa, la pantalla de administraci&oacute;n de fichas se actualizar&aacute; con la nueva cantidad de fichas del cliente:
<br><img src="screens/newcredit.png" width="330" height="181" /><br>
<h3>2.5 Dar de baja</h3>
Para dar de baja un cliente ser&aacute; necesario primeramente buscarlo.Para buscarlo lea el inciso 2.2. En la ventana de opciones seleccione &quot;Dar de baja&quot; y d&eacute; clic en OK:
<br><img src="screens/deletemember.png" width="532" height="258" /><br>
Dada la importancia de la operaci&oacute;n se le pedir&aacute; confirmaci&oacute;n. 
La operaci&oacute;n es irreversible.<br><img src="screens/deletememberconf.png" width="674" height="258" /><br>
<h2>3. Administraci&oacute;n de empleados</h2>
<h3>3.1 Dar de alta</h3>
<p>Para dar de alta un empleado vaya al men&uacute; Archivo / Nuevo empleado... Deber&aacute; ver una pantalla como la que se muestra a continuaci&oacute;n:
  <br>
  <img src="screens/newemployee.png" width="796" height="591" /><br>
La forma se validar&aacute; al momento de dar clic en el bot&oacute;n de Agregar. En caso de que exista alg&uacute;n error al llenar la forma, se le indicar&aacute; para su correcci&oacute;n. M&eacute;xico est&aacute; seleccionado autom&aacute;ticamente como pa&iacute;s pues no se pueden contratar empleados que vivan fuera de M&eacute;xico, la forma autom&aacute;ticamente desplegar&aacute; la lista de estados de la Rep&uacute;blica para que usted elija el apropiado. La aplicaci&oacute;n mostrar&aacute; pantallas de &eacute;xito o de error seg&uacute;n sea el caso.</p>
<h3>3.2 Buscar</h3>
Para buscar un empleado vaya al men&uacute; Administrar / Empleados... Se mostrar&aacute; una pantalla con todos los empleados registrados en el sistema en donde se pueden buscar para realizar operaciones con ellos. Los empleados se mostrar&aacute;n en orden alfab&eacute;tico por nombre:
<br><img src="screens/searchemployees.png" width="904" height="580" /><br>
Escriba en el cuadro de texto lo que desea buscar y la pantalla se actualizar&aacute; autom&aacute;ticamente con la informaci&oacute;n apropiada. Cuando el cuadro de texto est&eacute; vac&iacute;o, se mostrar&aacute;n todos los empleados en la base de datos.
<h3>3.3 Desactivar cuenta de usuario</h3>
Primero encuentre al empleado cuya cuenta desea desactivar siguiendo las instrucciones del inciso 3.2. Ahora d&eacute; doble clic sobre la fila del empleado a desactivar y seleccione la opci&oacute;n &quot;Desactivar cuenta de usuario&quot;:
<br><img src="screens/deactivateaccount.png" width="512" height="258" /><br>
Si tiene los suficientes permisos para desactivar la cuenta, se mostrar&aacute; un mensaje de confirmaci&oacute;n como el siguiente:
<br><img src="screens/accountdeactivated.png" width="426" height="258" /><br>
Posteriormente se actualizar&aacute; autom&aacute;ticamente la ventana de Administraci&oacute;n de empleados con el cambio realizado.
<h3>3.4 Reactivar cuenta de usuario</h3>
Primero encuentre al empleado cuya cuenta desea reactivar siguiendo las instrucciones del inciso 3.2. Ahora d&eacute; doble clic sobre la fila del empleado a reactivar y seleccione la opci&oacute;n &quot;Reactivar cuenta de usuario&quot;:
<br>
<img src="screens/reactivateaccount.png" width="512" height="258" /><br>
Si tiene los suficientes permisos para reactivar la cuenta, se mostrar&aacute; un mensaje de confirmaci&oacute;n como el siguiente:
<br>
<img src="screens/accountreactivated.png" width="416" height="258" /><br>
Posteriormente se actualizar&aacute; autom&aacute;ticamente la ventana de Administraci&oacute;n de empleados con el cambio realizado.
<h3>3.5 Dar de baja temporal</h3>
Primero encuentre al empleado que desea dar de baja siguiendo las instrucciones del inciso 3.2. Ahora d&eacute; doble clic sobre la fila del empleado y seleccione la opci&oacute;n &quot;Dar baja temporal&quot;:
<br>
<img src="screens/firetemp.png" width="512" height="258" /><br>
Si tiene los suficientes permisos para dar de baja al empleao, se mostrar&aacute; un mensaje de confirmaci&oacute;n como el siguiente:
<br>
<img src="screens/firetempconf.png" width="439" height="258" /><br>
Posteriormente se actualizar&aacute; autom&aacute;ticamente la ventana de Administraci&oacute;n de empleados con el cambio realizado.
<h3>3.6 Recontratar empleado</h3>
Primero encuentre al empleado que desea recontratar siguiendo las instrucciones del inciso 3.2. Ahora d&eacute; doble clic sobre la fila del empleado  y seleccione la opci&oacute;n &quot;Recontratar empleado&quot;:
<br>
<img src="screens/rehire.png" width="512" height="258" /><br>
Si tiene los suficientes permisos para recontratar al empleado, se mostrar&aacute; un mensaje de confirmaci&oacute;n como el siguiente:
<br>
<img src="screens/rehiretemp.png" width="379" height="258" /><br>
Posteriormente se actualizar&aacute; autom&aacute;ticamente la ventana de Administraci&oacute;n de empleados con el cambio realizado.
<h3>3.7 Dar de baja definitiva</h3>
No es posible dar de baja definitiva a un empleado dado que siempre se almacenar&aacute; informaci&oacute;n hist&oacute;rica de los mismos aunque ya no laboren en el casino.
<h3>3.8 Cambiar usuario o contrase&ntilde;a</h3>
Los usuarios no se pueden cambiar una vez que han sido creados. Por otra parte, las contrase&ntilde;as s&iacute; se pueden cambiar y esto se hace en la ventana de actualizar informaci&oacute;n personal. Tendr&aacute; que palomear la opci&oacute;n de &quot;Contrase&ntilde;a&quot; para indicar que sea cambiarla. Vea la secci&oacute;n 3.9 para m&aacute;s detalles.
<h3>3.9 Actualizar informaci&oacute;n personal</h3>
Primero encuentre al empleado cuya informaci&oacute;n desea actualizar siguiendo las instrucciones del inciso 3.2. Ahora d&eacute; doble clic sobre la fila del empleado y seleccione la opci&oacute;n &quot;Reactivar cuenta de usuario&quot;:
<br>
<img src="screens/editinfoemp.png" width="512" height="258" /><br>
Si tiene los suficientes permisos para actualizar la informaci&oacute;n, se mostrar&aacute; una pantalla coma la siguiente:
<br>
<img src="screens/editinfoempconf.png" width="796" height="596" /><br>
Haga los cambios correspondientes y d&eacute; clic sobre el bot&oacute;n de &quot;Guardar cambios&quot; al terminar. La forma se validar&aacute; como cuando se insert&oacute; el cliente.<br>
<h2>4. Administraci&oacute;n de tipos de juego</h2>
<h3>4.1 Dar de alta</h3>
Escriba en el cuadro de texto el juego que desea agregar y d&eacute; clic sobre &quot;Agregar&quot;. Si ya existe un tipo de juego con ese nombre, no se agregar&aacute; a la base de datos.<br><img src="screens/addgametype.png" width="420" height="260" /><br>
<h3>4.2 Dar de baja</h3>
Seleccione el juego de la lista que desea borrar y d&eacute; clic sobre &quot;Borrar&quot;. Se eliminar&aacute; instant&aacute;neamente.<br><img src="screens/deletegametype.png" width="420" height="260" /><br>
<br>   
<h2>5. Administraci&oacute;n de mesas</h2>
<h3>5.1 Dar de alta</h3>
Para registrar una mesa que f&iacute;sicamente exista en la sucursal debe escribir el ID de la mesa, que debe estar f&iacute;sicamente impreso en la mesa y seleccionar el tipo de juego que ofrecer&aacute; dicha mesa. Puede haber varias mesas que ofrezcan el mismo tipo de juego pero no puede haber m&aacute;s de una mesa con el mismo identificador. La existencia de mesas no implica que est&eacute; disponible para juego, para eso se tienen que usar sesiones.<br><img src="screens/addgametable.png" width="504" height="581" /><br>
<h3>5.2 Cambiar mesa de tipo de juego</h3>
<p>D&eacute; doble clic sobre la fila de la mesa que desea editar. Seleccione la opci&oacute;n de &quot;Cambiar tipo de juego&quot;. </p>
<p><br>
<img src="screens/updategametable.png" width="469" height="511" /></p>
<p>Ahora le aparecer&aacute; la siguiente pantalla. Deber&aacute; seleccionar el nuevo tipo de juego:</p>
<p><img src="screens/newtablegametype.png" alt="newgametype" width="527" height="258" /></p>
<p>D&eacute; clic en OK y el cambio se ver&aacute; reflejado en la ventana de administraci&oacute;n de mesas.<br>
</p>
<h3>5.3 Dar de baja</h3>
<p>D&eacute; doble clic sobre la mesa que desea eliminar, seleccione la opci&oacute;n de &quot;Eliminar mesa&quot; y d&eacute; clic en OK. El cambio se ver&aacute; reflejado posteriormente en la ventana de administraci&oacute;n de mesas de juego.</p>
<p><br>
  <img src="screens/deletegametable.png" width="469" height="514" /><br>
  <br>
</p>
<h2>6. Administraci&oacute;n de sesiones de juego</h2>
<img src="screens/adminsessions.png" alt="searching servers" width="924" height="624" /><br> 

<h2>7. Sincronizaci&oacute;n</h2>
<p>D&eacute; clic en el men&uacute; &quot;Servicios&quot; y luego en la opci&oacute;n de &quot;Sincronizar&quot;. Ver&aacute; la siguiente pantalla, en donde se estar&aacute; buscando a las otras sucursales disponibles. Para ello, se acceder&aacute; al servidor central.</p>
<p><img src="screens/searchingservers.png" alt="searching servers" width="326" height="122" /></p>
<p>Una vez que el servidor central env&iacute;a las sucursales que tienen permisos de recibir sincronizaciones, se desplegar&aacute; la siguiente pantalla.</p>
<p><img src="screens/syncform.png" alt="searching servers" width="604" height="481" /></p>
<p>El bot&oacute;n de &quot;Actualizar&quot; har&aacute; que la aplicaci&oacute;n se conecte al servidor central y traiga la lista de sucursales nuevamente. El bot&oacute;n de &quot;Sincronizar&quot; se conectar&aacute; con las sucursales disponibles a enviar la informaci&oacute;n mas reciente. Si hay alg&uacute;n error de sincronizaci&oacute;n &eacute;ste se desplegar&aacute;. Si no se muestra ninguna ventana, significa que se lograron hacer las actualizaciones.</p>
<p>&nbsp;</p>
<p><br> 
  
  <br>
  (c) Copyright Alfredo Fern&aacute;ndez Acu&ntilde;a (alfredofernandeza@gmail.com)
</p>
</body>
</html>